# -*- coding: utf-8 -*-
"""
шаблон для построения графиков
"""
import matplotlib  
def bar_graph:
    """

    Функция для создания кластеризованной столбчатой диаграммы 
    Качественный атрибут
    качественный атрибут

    """
def gist_graph:
    """
    Функция для создания категоризированной гистограммы
    Количественный атрибут
    Качественный атрибут 

    """
def Box_Whisker:
    """
    Функция для создания категоризированной  диаграммы  Бокса-Вискера
    Количественный атрибут
    Качественный атрибут
    
    """
def rass_graph:
    """
    Функция для создания категоризированной диаграммы рассеивания
    Количественный атрибут
    Количественный атрибут
    Качественный атрибут
    
    """
    
def plot_rating_of_all_users(film):
    """
    Функция для построения графика количества оценок от 0 до 5 по выбранному фильму
    
    """


def plot_amount_of_films_in_year():
    """
    Функция для построения графика с количеством фильмов с течением времени
    
    """

