def output_list_of_films(genre, year, user):
    """ вывод фильмов, которые 'лучший' пользователь оценил высоким баллом"""


def output_info_of_films(film):
    """вывод информации по фильму(год создания, жанры)"""


def choosing_year_or_genre(chossing_arg):
    """пользователь выбирает на экране предоставленные варианты жанров, периодов времени или фильмов"""


def choosing_film(genre, year):
    """выбор фильма, определенного жанра, определенного года на экране"""


def choosing_list_by_programm():
    """вывод списков, составленных программой, и выбор одного из них"""
